Revit 2027 API
FormatOptions.CanSuppressSpaces Method
 Checks whether spaces can be suppressed for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSuppressSpaces()
Public Function CanSuppressSpaces As Boolean
public:
bool CanSuppressSpaces()
member CanSuppressSpaces : unit -> bool
Return Value
Boolean
 True if spaces can be suppressed, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
CanSuppressSpaces Overload
Autodesk.Revit.DB Namespace